app/controllers/parsers_controller.rb

  def index
    @parsers = Parser.all
---
SELECT "parsers".* FROM "parsers"

  def create
    @parser = Parser.new(parser_params)

    respond_to do |format|
      if @parser.save
---
INSERT INTO "parsers" ("title", "file_file_name", "file_content_type", "file_file_size", "file_updated_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    def set_parser
      @parser = Parser.find(params[:id])
---
SELECT  "parsers".* FROM "parsers" WHERE "parsers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]